document.write("<div>5장 데이터 타입</div>");

// 데이터 타입이란? 데이터를 다루는 형태, 자료형!
// 자바스크립트의 자료형 : null, NaN, Boolean, 숫자, 문자열, undefined
// 숫자는 그냥 입력! -> 숫자의 산술 연산자 + - * / 
// 문자는 " " 또는 ' ' 사이에 입력! -> 문자열 함수 존재!
// .length / .toUpperCase() / .indexOf(찾는 것) / ,trim()
// .indexOf()는 제일 첫번째 값의 인덱스만 찾음!
// .trim()은 양 끝쪽의 공백만을 제거!

// 실습 : 이름 문자열을 각 음절로 띄어쓰기 정의
// 실습 : 길이
// 실습 : 대문자 변환
// 실습 : h찾기
// 실습 : 공백없애기

// 객체 끼리는 ==, === 비교 x
// => 객체를 원시 타입으로 바꿔서 비교해야 함.
// 갹체, 배열, 함수 등 참조 타입은 비교연산자를 통한 비교가 안된다!!!